rust-lifetime.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-10 Mon 20:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rust 生命周期（lifetime）解析</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zi Liang" />
<link rel="stylesheet" type="text/css" href="./css/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">rust 生命周期（lifetime）解析</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6a24d3c">1. 回顾ownership和reference。</a></li>
<li><a href="#orgdf32104">2. rust设计哲学</a></li>
<li><a href="#org754d92c">3. 生命周期解析</a>
<ul>
<li><a href="#org31bbf22">3.1. 先复杂化：引入生命周期</a></li>
<li><a href="#org1043a7c">3.2. 简化生命周期的描述</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
在阅读这篇文章之前，如果我不知道什么是所有权（ownership），那么我会先去搜索相关知识或者阅读<a href="rust-learning.html">这篇</a>笔记。
</p>

<p>
如果我之前学过所有权相关的知识，那么就不用去看了。
</p>

<div id="outline-container-org6a24d3c" class="outline-2">
<h2 id="org6a24d3c"><span class="section-number-2">1</span> 回顾ownership和reference。</h2>
<div class="outline-text-2" id="text-1">
<p>
首先试图回顾一下关于所有权和引用的一些问题。
所有权是指：一个指针在一个作用域内对一片内存空间的操作能力。rust规定了一片区域有且仅能有一个这样的指针，这个指针在编程语言里就是变量名。
但是：有时我们不得不频繁访问一个变量，如果仅仅按照所有权规则，我们必须不停地将这个指针传播。
为此，rust沿袭了引用的概念。一个变量的引用其实就是一个指针，这个指针指向了指向这个变量的指针，也就是这个指针指向了变量名。由此，我们就可以使用这个引用快速访问原有的数据，同时不会让变量名失去所有权。
但与此同时也会存在一些新的问题。
</p>
<ol class="org-ol">
<li>关于一致性的问题：正如我们之前介绍的，对于mut的变量，如果其引用也是mut的，
那么我们可以通过引用修改该变量的值。为了保持修改过程中没有问题，我们规定这种可写的引用只有一个。</li>
<li>第二个问题就是关于悬垂引用的问题。即如果我的这个变量被注销了——那么对应的数据也被清楚了。
如果此时我的这个引用还活着，该引用就可以被用来访问内存区域。——这是完全有可能的。而针对这一类问题的检查，就引出了生命周期这个思路。</li>
</ol>
</div>
</div>


<div id="outline-container-orgdf32104" class="outline-2">
<h2 id="orgdf32104"><span class="section-number-2">2</span> rust设计哲学</h2>
<div class="outline-text-2" id="text-2">
<p>
在介绍什么是生命周期之前，可能还需要简单介绍一下rust的设计哲学。我理解rust的设计哲学是：
</p>

<ul class="org-ul">
<li>将问题约束在编译时，而非运行时；</li>
<li>要求编程者更细粒度地表达其意图；</li>
<li>先复杂化，再简化；</li>
</ul>

<p>
现以生命周期为例，验证这些设计哲学。
</p>
</div>
</div>

<div id="outline-container-org754d92c" class="outline-2">
<h2 id="org754d92c"><span class="section-number-2">3</span> 生命周期解析</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org31bbf22" class="outline-3">
<h3 id="org31bbf22"><span class="section-number-3">3.1</span> 先复杂化：引入生命周期</h3>
<div class="outline-text-3" id="text-3-1">
<p>
我们先以一个返回两个字符串中最长的一个的函数，来引入生命周期的概念。
首先给出一个无法编译的代码：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FF1493;">fn</span> <span style="color: #87D700;">longest</span><span style="color: #AF87FF;">(</span><span style="color: #FF8C00;">x</span>: &amp;<span style="color: #5FD7FF;">str</span>, <span style="color: #FF8C00;">y</span>: &amp;<span style="color: #5FD7FF;">str</span><span style="color: #AF87FF;">)</span> -&gt; &amp;<span style="color: #5FD7FF;">str</span> <span style="color: #AF87FF;">{</span>
    <span style="color: #FF1493;">if</span> x.len<span style="color: #5FD7FF;">()</span> &gt; y.len<span style="color: #5FD7FF;">()</span> <span style="color: #5FD7FF;">{</span>
        x
    <span style="color: #5FD7FF;">}</span> <span style="color: #FF1493;">else</span> <span style="color: #5FD7FF;">{</span>
        y
    <span style="color: #5FD7FF;">}</span>
<span style="color: #AF87FF;">}</span>
</pre>
</div>
<p>
这个代码有什么问题？逻辑上当然是没有问题的。现在让我们试试用这个函数构造一个悬垂引用。
</p>

<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #FF1493;">let</span> s2=<span style="color: #CDC673;">"blabla"</span>;
<span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">smax</span>;
<span style="color: #AF87FF;">{</span>
<span style="color: #FF1493;">let</span> s1=<span style="color: #5FD7FF;">String</span>::from<span style="color: #5FD7FF;">(</span><span style="color: #CDC673;">"abcccccccccccc"</span><span style="color: #5FD7FF;">)</span>;
    smax=longest<span style="color: #5FD7FF;">(</span>s1.as_str<span style="color: #87D700;">()</span>,s2<span style="color: #5FD7FF;">)</span>;
<span style="color: #AF87FF;">}</span>
<span style="color: #FF1493;">println!</span><span style="color: #AF87FF;">(</span><span style="color: #CDC673;">"</span><span style="color: #CDC673; font-style: italic;">{}</span><span style="color: #CDC673;">"</span>, smax<span style="color: #AF87FF;">)</span>;

</pre>
</div>

<p>
如果没有lifetime，单纯靠所有权，是检查不出上述代码的问题的。同样地，在运行中，这段代码有时候也会执行正确（如果s2比s1长），但我们不能冒这个险——这就是rust的哲学。所以，既然存在风险，那么rust就会让这个函数不通过。————可是这样一个函数确实极其常见的，所以，rust强令我补充信息，所补充的信息就是各个变量的生命周期。
</p>

<p>
生命周期就是一个单引号形态的东西，跟定义类型一样，都是泛型的写法：
</p>

<p>
(泛型的文章请见：<a href="rust-trait-lifetime.html">这里</a>)
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FF1493;">fn</span> <span style="color: #87D700;">longest</span><span style="color: #AF87FF;">&lt;</span>'<span style="color: #FF8C00;">a</span><span style="color: #AF87FF;">&gt;(</span><span style="color: #FF8C00;">x</span>: &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span>, <span style="color: #FF8C00;">y</span>: &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span><span style="color: #AF87FF;">)</span> -&gt; &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span> <span style="color: #AF87FF;">{</span>
    <span style="color: #FF1493;">if</span> x.len<span style="color: #5FD7FF;">()</span> &gt; y.len<span style="color: #5FD7FF;">()</span> <span style="color: #5FD7FF;">{</span>
        x
    <span style="color: #5FD7FF;">}</span> <span style="color: #FF1493;">else</span> <span style="color: #5FD7FF;">{</span>
        y
    <span style="color: #5FD7FF;">}</span>
<span style="color: #AF87FF;">}</span>
</pre>
</div>

<p>
就像类型一般都是T一样，生命周期一般就用'a意思一下，具有相同的符号的变量，代表他们有相同的生命周期。
</p>

<p>
然后，编译器就会拿着这个生命周期去检查，看看使用这个函数的变量都满不满足这个生命周期的要求。当然，我们上面给的运行示例肯定是不满足这个生命周期的，所以编译器就会报错，这个错误就避免了。假如我这么用这个函数：
</p>
<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #FF1493;">let</span> s2=<span style="color: #CDC673;">"blabla"</span>;
<span style="color: #FF1493;">let</span> <span style="color: #FF8C00;">smax</span>;
<span style="color: #FF1493;">let</span> s1=<span style="color: #5FD7FF;">String</span>::from<span style="color: #AF87FF;">(</span><span style="color: #CDC673;">"abcccccccccccc"</span><span style="color: #AF87FF;">)</span>;
    smax=longest<span style="color: #AF87FF;">(</span>s1.as_str<span style="color: #5FD7FF;">()</span>,s2<span style="color: #AF87FF;">)</span>;
<span style="color: #FF1493;">println!</span><span style="color: #AF87FF;">(</span><span style="color: #CDC673;">"</span><span style="color: #CDC673; font-style: italic;">{}</span><span style="color: #CDC673;">"</span>, smax<span style="color: #AF87FF;">)</span>;

</pre>
</div>

<p>
就符合这个生命周期了，同时我们也可以发现，这段代码确实没有错。
</p>

<p>
一般而言，也就是根据我们的常识所能理解的：引用的存在周期肯定要在对应变量的存在周期内部，至少是其一个子集。我们提供的生命周期信息，就是为了检查这个东西。
</p>

<p>
下面给出一些变体：
</p>


<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #FF1493;">fn</span> <span style="color: #87D700;">longest</span><span style="color: #AF87FF;">&lt;</span>'<span style="color: #FF8C00;">a</span><span style="color: #AF87FF;">&gt;(</span><span style="color: #FF8C00;">x</span>: &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span>, <span style="color: #FF8C00;">y</span>: &amp;<span style="color: #5FD7FF;">str</span><span style="color: #AF87FF;">)</span> -&gt; &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span> <span style="color: #AF87FF;">{</span>
    x
<span style="color: #AF87FF;">}</span>

<span style="color: #FF1493;">struct</span> <span style="color: #5FD7FF;">ImportantExcerpt</span><span style="color: #AF87FF;">&lt;</span>'<span style="color: #FF8C00;">a</span><span style="color: #AF87FF;">&gt;</span> <span style="color: #AF87FF;">{</span>
    <span style="color: #FF8C00;">part</span>: &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span>,
<span style="color: #AF87FF;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org1043a7c" class="outline-3">
<h3 id="org1043a7c"><span class="section-number-3">3.2</span> 简化生命周期的描述</h3>
<div class="outline-text-3" id="text-3-2">
<p>
下面来试着简化生命周期的描述。如果一直写生命周期，就显得有些繁琐，因此rust也设计了简化生命周期描述的方式。主要包括三条规则：
</p>
<ol class="org-ol">
<li>单参数输入，输出与输入的生命周期相同——&gt;不用写；</li>
<li>如果输入中包括&amp;self或&amp; mut self，即一个方法，那么输出参数的生命周期与self一致；——&gt;省写</li>
<li>多参数输入，默认每一个参数的生命周期都不一样&#x2013;&gt;最坏情况。</li>
</ol>

<p>
举个例子，第一种情况：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FF1493;">fn</span> <span style="color: #87D700;">first_word</span><span style="color: #AF87FF;">(</span><span style="color: #FF8C00;">s</span>: &amp;<span style="color: #5FD7FF;">str</span><span style="color: #AF87FF;">)</span> -&gt; &amp;<span style="color: #5FD7FF;">str</span> <span style="color: #AF87FF;">{}</span>
<span style="color: #8B8878;">//</span><span style="color: #8B8878;">&#31561;&#20215;&#20110;</span>
<span style="color: #FF1493;">fn</span> <span style="color: #87D700;">first_word</span><span style="color: #AF87FF;">&lt;</span>'<span style="color: #FF8C00;">a</span><span style="color: #AF87FF;">&gt;(</span><span style="color: #FF8C00;">s</span>: &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span><span style="color: #AF87FF;">)</span> -&gt; &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span> <span style="color: #AF87FF;">{}</span>
</pre>
</div>

<p>
第二种情况：
</p>

<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #FF1493;">#!</span><span style="color: #AF87FF;">[</span><span style="color: #FF1493;">allow</span><span style="color: #5FD7FF;">(</span><span style="color: #FF1493;">unused</span><span style="color: #5FD7FF;">)</span><span style="color: #AF87FF;">]</span>
<span style="color: #FF1493;">fn</span> <span style="color: #87D700;">main</span><span style="color: #AF87FF;">()</span> <span style="color: #AF87FF;">{</span>
<span style="color: #FF1493;">struct</span> <span style="color: #5FD7FF;">ImportantExcerpt</span><span style="color: #5FD7FF;">&lt;</span>'<span style="color: #FF8C00;">a</span><span style="color: #5FD7FF;">&gt;</span> <span style="color: #5FD7FF;">{</span>
    <span style="color: #FF8C00;">part</span>: &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span>,
<span style="color: #5FD7FF;">}</span>

<span style="color: #FF1493;">impl</span><span style="color: #5FD7FF;">&lt;</span>'<span style="color: #FF8C00;">a</span><span style="color: #5FD7FF;">&gt;</span> <span style="color: #5FD7FF;">ImportantExcerpt</span><span style="color: #5FD7FF;">&lt;</span>'<span style="color: #FF8C00;">a</span><span style="color: #5FD7FF;">&gt;</span> <span style="color: #5FD7FF;">{</span>
    <span style="color: #FF1493;">fn</span> <span style="color: #87D700;">announce_and_return_part</span><span style="color: #87D700;">(</span>&amp;<span style="color: #FF1493;">self</span>, <span style="color: #FF8C00;">announcement</span>: &amp;<span style="color: #5FD7FF;">str</span><span style="color: #87D700;">)</span> -&gt; &amp;<span style="color: #5FD7FF;">str</span> <span style="color: #87D700;">{</span>
        <span style="color: #FF1493;">println!</span><span style="color: #CDC673;">(</span><span style="color: #CDC673;">"Attention please: </span><span style="color: #CDC673; font-style: italic;">{}</span><span style="color: #CDC673;">"</span>, announcement<span style="color: #CDC673;">)</span>;
        <span style="color: #FF1493;">self</span>.part
    <span style="color: #87D700;">}</span>
<span style="color: #5FD7FF;">}</span>
<span style="color: #AF87FF;">}</span>

</pre>
</div>

<p>
第三种情况：
</p>
<div class="org-src-container">
<pre class="src src-rust">  <span style="color: #FF1493;">fn</span> <span style="color: #87D700;">longest</span><span style="color: #AF87FF;">(</span><span style="color: #FF8C00;">x</span>: &amp;<span style="color: #5FD7FF;">str</span>, <span style="color: #FF8C00;">y</span>: &amp;<span style="color: #5FD7FF;">str</span><span style="color: #AF87FF;">)</span> -&gt; &amp;<span style="color: #5FD7FF;">str</span> <span style="color: #AF87FF;">{}</span>
    <span style="color: #8B8878;">//</span><span style="color: #8B8878;">&#31561;&#20215;&#20110;</span>
<span style="color: #FF1493;">fn</span> <span style="color: #87D700;">longest</span><span style="color: #AF87FF;">&lt;</span>'<span style="color: #FF8C00;">a</span>, '<span style="color: #FF8C00;">b</span><span style="color: #AF87FF;">&gt;(</span><span style="color: #FF8C00;">x</span>: &amp;'<span style="color: #FF8C00;">a</span> <span style="color: #5FD7FF;">str</span>, <span style="color: #FF8C00;">y</span>: &amp;'<span style="color: #FF8C00;">b</span> <span style="color: #5FD7FF;">str</span><span style="color: #AF87FF;">)</span> -&gt; &amp;<span style="color: #5FD7FF;">str</span> <span style="color: #AF87FF;">{}</span>
</pre>
</div>


<p>
关于lifetime的内容就是这些，一些static等虾米就不整理了。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fri Nov 19 09:36:11 2021</p>
<p class="author">Author: Zi Liang</p>
<p class="date">Created: 2022-01-10 Mon 20:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
